In [73]:
import pandas as pd
import numpy as np

In [74]:
turnover_1 = pd.read_csv("data/turnover_1.csv")
turnover_2 = pd.read_csv("data/turnover_2.csv")

In [75]:
turnover_1

  EMPLEE_ID  WORK_HRS_NUM  WORK_DT_ID
0      e100             4    20190101
1      e200             5    20190102
2      e300             6    20190103

In [76]:
turnover_2

  EMPLEE_ID  WORK_HRS_NUM  WORK_DT_ID
0      e100             7    20190201
1      e200             8    20190202
2      e300             9    20190203

In [77]:
# concatenate the 2 csv
combined_df = pd.concat( [ turnover_1, turnover_2 ] )
combined_df

  EMPLEE_ID  WORK_HRS_NUM  WORK_DT_ID
0      e100             4    20190101
1      e200             5    20190102
2      e300             6    20190103
0      e100             7    20190201
1      e200             8    20190202
2      e300             9    20190203

In [79]:
# sort the combined dataframe by employee ID
combined_df = combined_df.sort_values(by='EMPLEE_ID') 
combined_df

  EMPLEE_ID  WORK_HRS_NUM  WORK_DT_ID
0      e100             4    20190101
0      e100             7    20190201
1      e200             5    20190102
1      e200             8    20190202
2      e300             6    20190103
2      e300             9    20190203